tap "chipsalliance/verible"
tap "codecrafters-io/tap"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "rbenv/tap"
tap "yanjiew1/gtkwave"
brew "ack"
brew "libpng"
brew "glib"
brew "lzo"
brew "xz"
brew "zstd"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "libyaml"
brew "openssl@3"
brew "apr-util"
brew "aspell"
brew "at-spi2-core"
brew "gdbm"
brew "openssl@1.1"
brew "python@3.10"
brew "autojump"
brew "automake"
brew "gtk4"
brew "baobab"
brew "bash"
brew "bash-completion"
brew "bazel"
brew "berkeley-db"
brew "bison"
brew "boost"
brew "python@3.9"
brew "ghc"
brew "cabal-install"
brew "gmp"
brew "coreutils"
brew "libevent"
brew "p11-kit"
brew "unbound", restart_service: :changed
brew "gnutls"
brew "emacs", link: false
brew "cask"
brew "chruby"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coq"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "docker"
brew "dos2unix"
brew "dosbox"
brew "duf"
brew "exercism"
brew "expect"
brew "fd"
brew "findutils"
brew "flex"
brew "fzf"
brew "python@3.12"
brew "gcovr"
brew "libavif"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "git-gui"
brew "gnu-typist"
brew "libusb"
brew "go"
brew "gobject-introspection"
brew "golangci-lint"
brew "googletest"
brew "gopls"
brew "goreleaser"
brew "netpbm"
brew "graphviz"
brew "grep"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gtksourceview3"
brew "guile"
brew "haskell-stack"
brew "htop"
brew "icarus-verilog"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "imagemagick@6"
brew "ipmitool"
brew "ispell"
brew "jpeg", link: true
brew "lcov"
brew "ldns"
brew "libffi"
brew "libfido2"
brew "libgit2"
brew "libproxy"
brew "libssh"
brew "lilypond"
brew "make"
brew "mas"
brew "math-comp"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "node"
brew "oha"
brew "opam"
brew "openjdk"
brew "openssh"
brew "pandoc"
brew "poppler"
brew "pdf2svg"
brew "pdfgrep"
brew "perl"
brew "podman"
brew "pyright", link: false
brew "tcl-tk"
brew "python-tk@3.12"
brew "python@3.11"
brew "vde"
brew "qemu"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "rbenv-gemset"
brew "rename"
brew "ripgrep"
brew "rmtrash"
brew "ruby-install"
brew "rust"
brew "scons"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sloccount"
brew "ssh-copy-id"
brew "subversion"
brew "surfer"
brew "svg2png"
brew "telegram-downloader"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"
brew "trash-cli", link: true
brew "tree"
brew "vcpkg"
brew "verilator"
brew "wget"
brew "wxwidgets"
brew "xapian"
brew "xml2"
brew "yapf"
brew "yq"
brew "chipsalliance/verible/verible"
brew "codecrafters-io/tap/codecrafters"
brew "railwaycat/emacsmacport/emacs-mac@29", link: false
brew "yanjiew1/gtkwave/gtkwave"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "anaconda"
cask "ankiapp"
cask "brave-browser"
cask "calibre"
cask "clockify"
cask "coconutbattery"
cask "discord"
cask "dropbox"
cask "eclipse-ide"
cask "emacs"
cask "firefox"
cask "flux"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-inconsolata-lgc"
cask "font-jetbrains-mono"
cask "font-linux-libertine"
cask "font-source-code-pro"
cask "free-download-manager"
cask "freedom"
cask "goneovim"
cask "google-chrome"
cask "inkscape"
cask "intellij-idea"
cask "isabelle"
cask "iterm2"
cask "itsycal"
cask "julia"
cask "kitty"
cask "klayout"
cask "libreoffice"
cask "mactex"
cask "mathpix-snipping-tool"
cask "mendeley"
cask "microsoft-edge"
cask "obsidian"
cask "racket"
cask "rectangle"
cask "simplenote"
cask "skype"
cask "slack"
cask "soda-player"
cask "spectacle"
cask "spotify"
cask "squirrel"
cask "sublime-text"
cask "teamviewer"
cask "texstudio"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "xquartz"
cask "zettlr"
cask "zoom"
cask "zotero"
mas "1Password", id: 443987910
mas "Be Focused Pro", id: 961632517
mas "Foxit PDF Reader", id: 1032155965
mas "GarageBand", id: 682658836
mas "Habitify", id: 1111447047
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "ScreenZen", id: 1541027222
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mshr-h.veriloghdl"
vscode "twxs.cmake"
vscode "vscodevim.vim"
